Revit 2020 API
PathOfTravelCalculationRequestType Enumeration
 An enumerated type containing possible requests for the Path of Travel calculation.
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 20.0.0.0 (20.0.0.377)
Since: 2020
Since: 2020
Syntax
C#
public enum PathOfTravelCalculationRequestType
Visual Basic
Public Enumeration PathOfTravelCalculationRequestType
Visual C++
public enum class PathOfTravelCalculationRequestType
Members
Member name | Description
CalculateForCorrespondingStartEndPairs |  Calculate paths of travel between corresponding pairs of start and end points.
CalculateForAllPossibleStartEndPairs |  Calculate paths of travel between all possible pairs of start and end points.
CalculatePathOfTravelObstaclesInView |  Calculate only path of travel obstacles in the view.
See Also
Autodesk.Revit.DB.Analysis Namespace